import "leaflet/dist/leaflet.css";
import "../styles/Header.css"; // Assuming you have a CSS file for styles
import SidebarWidgets from "./SidebarWidgets";

const MainComponent = () => {
  return (
    <div dir="rtl">
      {/* ✅ SECTION: Cards */}
      <div className="card_MainComponent">
        <h1>زهرة الكويت</h1>
        <p>
          عن الشركة زهرة الكويت شركة كويتية واعدة تقدم أفضل خدمات النظافة العامة
          ونقل الأثاث من وإلى كل محافظات الكويت مع توفير أفضل المبيدات الحشرية
          لمحاربة الحشرات بكل أشكالها، شركة زهرة الكويت توفر أفضل المهندسين
          المسئولين عن صيانة لكافة أنواع الأجهزة مثل التكيفات والرسيفر وتركيب
          وصيانة الستلايت وغيرها من الخدمات …
        </p>
      </div>
      <div className="card_MainComponent_h1">
        <h1>عن الشركة زهرة الكويت والخدمات التي تقدمها :-</h1>
      </div>
      <div className="card_MainComponent_bloge">
        <h1> التنظيف بالكويت :</h1>
        <p>
          تعمل شركة زهرة الكويت لتوفير عمالة تساعدك في تنظيف المنازل والفلل
          والشقق المفروشة والمستأجرة ، كما نقوم بتوفير عمالة بأعداد كبيرة بأجهزة
          بخار ومنظفات عالية الجودة لتنظيف السجاد والكنب والمدارس والمساجد
          والمولات{" "}
        </p>
      </div>

      <div className="card_MainComponent_bloge">
        <h1>مكافحة الحشرات بالكويت :</h1>
        <p>
          توفر شركة زهرة الكويت خدمات إبادة الحشرات مهما كانت أعدادها وأنوعها
          لدينا فرق رش مبيدات للقضاء على النمل والجرذان والبعوض وكافة الحشرات
          المنزلية وحشرات المزارع والمسطحات الخضراء، وتركيب طارد الحمام للحفاظ
          على منزلك من كل المنغصات والأوبئة.{" "}
        </p>
      </div>

      <div className="card_MainComponent_bloge">
        <h1> نقل العفش بالكويت :</h1>
        <p>
          تحرص شركة زهرة الكويت على توفير سيارات وعمالة مدربة لنقل العفش عبر كل
          المدن الكويتية بسعر مناسب في أقل وقت بدون إحداث أضرار للممتلكات
        </p>
      </div>

      <div className="card_MainComponent_bloge">
        <h1> بنشر متنقل بالكويت :</h1>
        <p>
          نوفر عمال صيانة سريعة على الطرق ليكونوا على جاهزية تامة لتصليح
          السيارات ودعمها بالوقود وقطع الغيار اللازمة.
        </p>
      </div>

      <div className="card_MainComponent_bloge">
        <h1>فني صحي بالكويت :</h1>
        <p>
          توفير أفضل سباك بالكويت لأعمال صيانة السباكة المنزلية وتركيب مواسير
          الصرف الصحي والأحواض وتشطيب سباكة المنازل والمنشآت الحديثة وتصليح
          الأعطال وتسليك المجاري بأقل الأسعار
        </p>
      </div>

      <div className="card_MainComponent_bloge">
        <h1> قني ستلايت بالكويت :</h1>
        <p>
          نقدم في شركة زهرة الكويت أفضل فني ستلايت لتركيب الدش وتصليح الرسيفر
          وتنظيم قنوات التلفاز وتصليح أعطال ضعف الإشارة وتحميل أحدث الترددات
          والاشتراك في قنوات بن سبورت .
        </p>
      </div>

      <div className="card_MainComponent_bloge">
        <h1> فني صيانة تكيف مركزي بالكويت :</h1>
        <p>
          لصيانة وتنظيف التكيفات المركزية والتكيفات الاسبليت والشباك مع توفير
          قطع الغيار الأصلية .
        </p>
      </div>

      <div className="card_MainComponent_bloge">
        <h1> كما نوفر لكم بعض الخدمات المميزة مثل :-</h1>
        <p>
          فني كهربائي لصيانة وتصليح الأعطال الكهربائية وتركيب وصلات الكهرباء
          بأفضل الوصلات والاكسسوارات الكهربية ووحدات الإضاءة الحديثة وتصليح
          كهرباء السيارات بمختلف ماركتها
        </p>
        <p>
          فنيين تركيب كاميرات مراقبة بأسعار مناسبة للكاميرات الألمانية لمراقبة
          المحلات والمولات وكاميرات مراقبة منزلية لتوفير الأمن والسلامة لعائلتك.
        </p>
        <p>
          شركة زهرة الكويت توفر أفضل أنواع العشب الصناعي مع توفير عمالة متخصصة
          لتركيب العشب الصناعي بالضمان للفلل والقصور والمتنزهات العامة والخاصة .{" "}
        </p>
      </div>
      <SidebarWidgets />
    </div>
  );
};

export default MainComponent;
